Revit 2026 API

# ExportResolution Enumeration

---

An enumerated type listing possible options to control the tessellation quality.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ExportResolution
```
```vb
Public Enumeration ExportResolution
```
```cpp
public enum class ExportResolution
```
```fsharp
type ExportResolution
```

| Member name | Value | Description |
| --- | --- | --- |
| Coarse | 3 | Tessellated export with coarse resolution. |
| Custom | 0 | Tessellated export with custom resolution (all tessellation parameters have default values). |
| Fine | 1 | Tessellated export with fine resolution. |
| Medium | 2 | Tessellated export with medium resolution. |

#### Reference

Autodesk.Revit.DB Namespace